app/views/post/show.html.erb

SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = ? LIMIT 1  [[nil, 1]]
---

<% if @showPost.comments.empty? %>