app/controllers/comment_controller.rb

  def create
     newComment = Comment.new
    newComment.content = params[:content]
    newComment.post_id = params[:post_id]
    newComment.user = current_user
    newComment.save
---
INSERT INTO "comments" ("content", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dd"], ["User_id", 1], ["created_at", "2018-03-10 08:35:09.136398"], ["updated_at", "2018-03-10 08:35:09.136398"]]