app/controllers/post_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "aa"], ["content", "aa"], ["user_id", 1], ["created_at", "2018-03-10 08:18:54.467606"], ["updated_at", "2018-03-10 08:18:54.467606"]]
---
  def create
    newPost = Post.new
    newPost.title = params[:title]
    newPost.content = params[:content]
    newPost.user = current_user
    newPost.image = params[:image]
    newPost.audio = params[:audio]

    if params[:avatar]
      newPost.avatar = params[:avatar]
    end
    newPost.save

SELECT "posts".* FROM "posts"
---
  def index
    @listPost = Post.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @showPost = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def edit
    @editPost = Post.find(params[:id])